In [1]:
import sqlite3

In [2]:
con = sqlite3.connect('db')

In [3]:
import pandas as pd

In [4]:
data = [[1, 'Joe', 85000, 1], [2, 'Henry', 80000, 2], [3, 'Sam', 60000, 2], [4, 'Max', 90000, 1], [5, 'Janet', 69000, 1], [6, 'Randy', 85000, 1], [7, 'Will', 70000, 1]]
employee = pd.DataFrame(data, columns=['id', 'name', 'salary', 'departmentId']).astype({'id':'Int64', 'name':'object', 'salary':'Int64', 'departmentId':'Int64'})
data = [[1, 'IT'], [2, 'Sales']]
department = pd.DataFrame(data, columns=['id', 'name']).astype({'id':'Int64', 'name':'object'})

In [5]:
employee.to_sql('employee', con, index=False, if_exists='replace')

7

In [6]:
department.to_sql('department', con, index=False, if_exists='replace')

2

In [7]:
sql = '''
    select
        dep,
        emp,
        salary
    from
        (
    select
            dense_rank() over(partition by d.name order by salary desc) as rnk,
            d.name as dep,
            e.name as emp,
            salary
        from employee e
        join department d on e.departmentId = d.id
        ) t1
        where rnk < 4
'''

In [8]:
pd.read_sql(sql, con)

     dep    emp  salary
0     IT    Max   90000
1     IT    Joe   85000
2     IT  Randy   85000
3     IT   Will   70000
4  Sales  Henry   80000
5  Sales    Sam   60000